app/Http/Controllers/Auth/AuthController.php

select * from `users` where `id` = 1 limit 1
---
    public function handleLogin(Request $request)
    {
        if (
            Auth::attempt([
                'email' => $request->email,
                'password' => $request->password
            ])
            && $request->{'g-recaptcha-response'} != null
        ) {

            $user = User::where('id', Auth::user()->id)->first();