app/Http/Controllers/Client/CourseController.php

    public function show($slug,Course $course)
    {
        $comments = $course->commentCourses()->get();
---
select * from `comment_courses` where `comment_courses`.`course_id` = 3 and `comment_courses`.`course_id` is not null