app/Http/Controllers/Client/HomeController.php

    public function index()
    {
        $cate = CateCourse::all();
        // Notification::Auth()->find('')->update(['read_at'=>now()]);
        // dd(Auth::user()->unreadNotifications->first()->data);
        $courses = Course::select('*');
        if(auth()->user()){
            $courses_id = auth()->user()->load('courses')->courses->pluck('id')->toArray();
            $courses = $courses->whereNotIn('id',$courses_id);
        }
        $courses =  $courses->get();
// dd($courses->toArray());
        $courses->transform(
            function (Course $course) {
                return [
                    ...$course->toArray(),
                    ...['chapter' => $course->with('chapters')->count()],
                    ...['lesson' => $course->with('lessons')->count()]
                ];
            }
        )->toJson();
---
select * from `courses` where 1 = 1
select `courses`.*, `owner_course`.`user_id` as `pivot_user_id`, `owner_course`.`course_id` as `pivot_course_id` from `courses` inner join `owner_course` on `courses`.`id` = `owner_course`.`course_id` where `owner_course`.`user_id` in (1)
select * from `courses` where `id` not in (3, 6, 9, 2, 3, 4)
select * from `chapters` where `chapters`.`course_id` = 1 and `chapters`.`course_id` is not null
select `lessons`.*, `chapters`.`course_id` as `laravel_through_key` from `lessons` inner join `chapters` on `chapters`.`id` = `lessons`.`chapter_id` where `chapters`.`course_id` = 1
select count(*) as aggregate from `courses`