app/Http/Controllers/Client/LessonController.php

    public function index(Course $course)
    {
        $chapters = $course->load('chapters')->chapters()->orderBy('id')->get();

        $lesson = $chapters->first()->lessons()->orderBy('id')->first();

        $mentor = $lesson->chapter->mentor;

        auth()->user()
            ->load('lesson_user')
            ->lesson_user()
            ->syncWithoutDetaching([$lesson->id => ['course_id' => $course->id]]);
---
select * from `chapters` where `chapters`.`course_id` = 3 and `chapters`.`course_id` is not null
select `users`.*, `owner_course`.`course_id` as `pivot_course_id`, `owner_course`.`user_id` as `pivot_user_id` from `users` inner join `owner_course` on `users`.`id` = `owner_course`.`user_id` where `owner_course`.`course_id` = 3 limit 1