app/Http/Controllers/Client/OrderController.php

select * from `courses` where `id` in ('2', '3')
---
    public function pay(Request $course)
    {
        $courses = Course::whereIn('id', $course->products)->get();

insert into `orders` (`user_id`, `total_price`, `status`, `updated_at`, `created_at`) values (1, 500000, 1, '2022-11-08 08:23:28', '2022-11-08 08:23:28')
insert into `order_details` (`course_id`, `order_id`, `price`) values (2, 11, 400000), (3, 11, 100000)
select `courses`.*, `owner_course`.`user_id` as `pivot_user_id`, `owner_course`.`course_id` as `pivot_course_id` from `courses` inner join `owner_course` on `courses`.`id` = `owner_course`.`course_id` where `owner_course`.`user_id` in (1)
delete from `carts` where `id` = 2
select * from `carts` where `id` in ('2', '3')
---
            function ($course) {
                $course->price = $course->current_price;
                return [...$course->only('price'), ...['course_id' => $course->id]];
            }
        );

        $total_price = $courses->sum('price');

        $order = Order::create([
            'user_id' => auth()->user()->id,
            'total_price' => $total_price,
            'status' => 1
        ]);

        $order->orderDetails()->attach($courses->toArray());

        auth()->user()->load('courses')
        ->courses()
        ->attach($request->course_id);

        Cart::destroy($request->course_id);

        return redirect()->route('client.order.cartList')->with('success','Bạn mua các khóa học thành công');