app/Providers/ViewServiceProvider.php

    public function register()
    {
        View::composer(['layouts.client.header'], function ($view) {
            if (auth()->user()) {
                $carts = auth()->user()->load('carts')->carts;
                $view->with('carts', $carts);
            } else {
                $view->with('carts', []);
            }
        });

        View::composer(['components.client.home.onwer-course'], function ($view) {
            if (auth()->user()) {
                $ownerCourse = auth()->user()->load('courses')
                    ->courses()
                    ->select('*')
                    ->get();
                $view->with('ownerCourse', $ownerCourse);
            } else {
                $view->with('ownerCourse', []);
            }
        });
---
select `courses`.*, `owner_course`.`user_id` as `pivot_user_id`, `owner_course`.`course_id` as `pivot_course_id` from `courses` inner join `owner_course` on `courses`.`id` = `owner_course`.`course_id` where `owner_course`.`user_id` in (1)
select *, `owner_course`.`user_id` as `pivot_user_id`, `owner_course`.`course_id` as `pivot_course_id` from `courses` inner join `owner_course` on `courses`.`id` = `owner_course`.`course_id` where `owner_course`.`user_id` = 1