app/Http/Controllers/Admin/ChapterController.php

    public function store(Request $request)
    {
        Chapter::create(
            array_merge(
                $request->all('title', 'course_id'),
                ['sort' => Chapter::where('course_id', $request->course_id)->max('sort') + 1 ?? 0]
            )
        );
---
insert into `chapters` (`title`, `course_id`, `sort`, `updated_at`, `created_at`) values ('asdasdasd', '1', 18, '2022-11-08 08:24:14', '2022-11-08 08:24:14')
select max(`sort`) as aggregate from `chapters` where `course_id` = '1'