app/Http/Controllers/Admin/CourseController.php

    public function index()
    {
        $courses = Course::select('*')->get();
---
select * from `courses`

    public function program($course_id)
    {
        $chapters = Chapter::select('*')
            ->where('course_id', $course_id)
            ->orderBy('sort')
            ->paginate();
---
select * from `chapters` where `course_id` = '1' order by `sort` asc limit 15 offset 0
select count(*) as aggregate from `chapters` where `course_id` = '1'