app/Http/Controllers/Admin/LessonController.php

select * from `chapters` where `course_id` = '1'
---
    public function create(Request $course_id)
    {
        $chapters = Chapter::where('course_id', $course_id->course)->get();

insert into `lessons` (`title`, `content`, `lesson_type`, `chapter_id`, `sort`, `updated_at`, `created_at`) values ('đâsda', 'ádasdadasd', 'video', '7', 58, '2022-11-08 12:22:49', '2022-11-08 12:22:49')
select max(`sort`) as aggregate from `lessons` where `chapter_id` = '7'
---
    public function store(Request $request, VimeoService $vimeoService)
    {
        if ($request->lesson_type === "video") {

            $lesson = Lesson::create(
                array_merge(
                    $request->only(
                        [
                            'title',
                            'content',
                            'lesson_type',
                            'attachment',
                            'chapter_id'
                        ]
                    ),
                    ['sort' => Lesson::where('chapter_id', $request->chapter_id)->max('sort') + 1 ?? 0]
                )
            );