app/Http/Controllers/Admin/UserController.php

select `id`, `name`, `email`, `password` from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function filterData(Request $request)
    {
        $users = User::select('id','name','email','password')
        ->name($request)
        ->paginate($request->record);